---
kind: other
id: Methods.T:Autodesk.Revit.DB.FaceArrayIterator
source: html/af5d3da2-afab-ff2d-95bd-ff659e5bc101.htm
---
# FaceArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.